#1 уровень, задание 5
#Вычислите сумму квадратов 10 членов арифметической прогрессии
n = int(input())
i = 1
s = 0
while i <= n:
    s = s + i ** 2
    i += 1
print(s)
