#3 уровень, задание 1
#Вычислить сумму s, прекращая суммирование, когда очередной член суммы по абсолютной величине станет меньше 0,0001, при изменении аргумента x в указанном диапазоне [a,b] с шагом h. Для сравнения в каждой точке вычислить функцию, являющаюся аналитическим выражением ряда S = (-1)1**i * x ** 2i\ (2i)!,  y = cos x, a = 0,1 b = 1 h = 0,1

from math import *
a = 0.1
b = 1
i = 0
s = 0
while abs(a) > 0.0001:
    x = 0.1
    i = 1
    while x < 1:
        a = ((-1)**i)*(x**(2*i))/(factorial(2*i))
        s = s + a
        x += 0.1
        b = b + cos(x)
        i += 1
        print(s, b)








