# Лабараторная работа № 2
# Задание 12, уровень 2
# Вводя значение r вычислить по выбору площадь квадрата со стороной r, площадь круга с радиусом r или площадь равностороннего треугольника со стороной r. Используйте множественный выбор.
n = int(input("Введите количество значений: "))
r = int(input("Введите значение r: "))
for i in range(n):
    v = int(input("Введите цифру 1, 2 или 3: "))
    if v == 1:
        s = r ** 2
        print("Площадь квадрата со стороной r = ", s)
    else:
        if v == 2:
            s = r ** 2 * 3.14
            print("Площадь круга с радиусом r = ", s)
        else:
            if v == 3:
                s = ((r ** 2) * (3 ** 0.5))/4
                print("Площадь равностороннего треугольника со стороной r = ", s)

# Задание 2, уровень 2
#В компьютер по очереди вводятся координаты n точек. Определить сколько из них попадают в круг с радиусм r с центром в точке (a,b) 
import math
def curcle(x,y,a,b,r):
    d = (x-a)**2+(y-b)**2
    return d <= r**2
a = float(input("Введите координату a центра круга "))
b = float(input("Введите координату b центра круга "))
r = float(input("Введите радиус круга "))
n = int(input("Введите количество точек "))
count = 0
for i in range(n):
    x = float(input("Введите кординату х точки: "))
    y = float(input("Введите кординату y точки: "))
    if curcle(x,y,a,b,r) == True:
        count += 1
print(f"Количество точек, попавших в круг: {count} ")


            
    
