# Лабараторная работа № 2
# Задание 12, уровень 2
# Вводя значение r вычислить по выбору площадь квадрата со стороной r, площадь круга с радиусом r или площадь равностороннего треугольника со стороной r. Используйте множественный выбор.
r = int(input())
v = int(input())
if v == 1:
    s = r ** 2
    print(s)
else:
    if v == 2:
        s = r ** 2 * 3.14
        print(s)
    else:
        if v == 3:
            s = ((r ** 2) * (3 ** 0.5))/4
            print(s)
            
    
