# Лабараторная работа № 2
# Задание 12, уровень 2
# Вводя значение r вычислить по выбору площадь квадрата со стороной r, площадь круга с радиусом r или площадь равностороннего треугольника со стороной r. Используйте множественный выбор.
n = int(input("Введите количество значений: "))
r = int(input("Введите значение r: "))
for i in range(n):
    v = int(input("Введите цифру 1, 2 или 3: "))
    if v == 1:
        s = r ** 2
        print("Площадь квадрата со стороной r = ", s)
    else:
        if v == 2:
            s = r ** 2 * 3.14
            print("Площадь круга с радиусом r = ", s)
        else:
            if v == 3:
                s = ((r ** 2) * (3 ** 0.5))/4
                print("Площадь равностороннего треугольника со стороной r = ", s)


            
    
